# FillPattern Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..Reference..::..FillPattern Property
SpecTypeId..::..Reference Class See Also
---
Fill Pattern, in discipline Common.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FillPattern { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FillPattern As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FillPattern {
	ForgeTypeId^ get ();
}
```

# See Also
SpecTypeId..::..Reference Class
Autodesk.Revit.DB Namespace